#include<stdio.h>
#include<stdlib.h>

void toA(int value) {
	char string[100] = { 0 };
	_itoa_s(value, string, 100, 2); //转换成2进制，并存入string
	printf("%s\n", string); //打印string
}

int main() {

	/*
	* 位运算：与 或 非 异或 取反 左移 右移
	* 与 &：转换成2进制，对应位都为1则为1，否则为0
	* 或 |：转换成2进制，对应位有一个为1则为1，否则为0
	* 非 ~：转换成2进制，0变1，1变0，变换后是一个数的补码形式，最高位是符号位，再转换成2进制原码
	* 异或 ^：转换成2进制，对应位相同则为0，不同则为1
	* 左移：将二进制数向左移动指定位数，右侧补0
	* 右移：将二进制数向右移动指定位数，左侧补0
	*/
	//一个字节占2进制的8位，int 4个字节32位
	int a = -5;      // 0000 0101
	int b = 5;       // 0000 0101
	int c = 2;	     // 0000 0010

	printf("%d\n", a);
	toA(a);

	//5
	//原码：0000 0000 0000 0000 0000 0000 0000 0101 //1个字节8位，int 4个字节32位
	//反码补码都一样

	//-5以补码的形式存储在计算机中
	//-5的原码：1000 0000 0000 0000 0000 0000 0000 0101 //第一个是符号位，0正1负
	//-5的反码：1111 1111 1111 1111 1111 1111 1111 1010 //符号位不变，其他位取反
	//-5的补码：1111 1111 1111 1111 1111 1111 1111 1011 //反码+1

	printf("%d\n", b & c); //0
	printf("%d\n", b | c); //7
	printf("%d\n", ~b);	//-6
	printf("%d\n", b ^ c); //7 5是 0000 0101 2是 0000 0010 现在00异或是0,11异或也是0
	printf("%d\n", b << 2); //20 5是 0000 0101 左移两位是 0001 0100 右侧补0
	printf("%d\n", b >> 2); //1 5是 0000 0101 右移两位是 0000 0001 左侧补0
	//5原码：0000 0000 0000 0000 0000 0000 0000 0101
	//~5是一个数的补码：1111 1111 1111 1111 1111 1111 1111 1010
	//~5的反码是：      1111 1111 1111 1111 1111 1111 1111 1001
	//~5的原码是：      1000 0000 0000 0000 0000 0000 0000 0110 //-6


	return 0;
}